



1비트
1바이트 = 8비트
1킬로바이트 = 1000바이트
1메가바이트 = 1000킬로바이트
1기가바이트 = 1000메가바이트


16기가 램

1바이트가 ㅁ 한개
16기가램이면
ㅁ가 몇개일까

1바이트 x 1000 x 1000 x 1000 x 16

ㅁ가 160억개있어

1번지
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ 보통 운영체제가 씀 windows같은 그래서 접근하려하면 터질수있어 그래서 windows가 에러띄움야 너 접근하지마 
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ 160억번지

ㅁ를 확대

ㅇㅇㅇㅇㅇㅇㅇㅇ
b b b b b b b b



int a = 4;

int는 4바이트형
4바이트의 메모리를 잡아먹는녀석
ㅁㅁㅁㅁ




















